let a1 = 5 % 3; 
let a2 = 3 % 5;
let a3 = 5 + '3';
let a4 ='5'- 3;
let a5 =75 + 'кг';
let a6 = 785 * 653;
let a7 = 100 / 25;
let a8 = 0 * 0;
let a9 = 0 / 2;
let a10 = 89 / 0;
let a11 = 98 + 2;
let a12 = 5 - 98;
let a13 = (8 + 56 * 4) / 5;
let a14 = (9 - 12) * 7 / (5 + 2);
let a15 = +"123";
let a16 = 1 || 0;
let a17 = false || true;
let a18 = true > 0;


console.log('Выражение 5 % 3 равно',a1,'и принадлежит типу',typeof(a1));
console.log('Выражение 3 % 5 равно',a2,'и принадлежит типу',typeof(a2));
console.log("Выражение 5 + '3' равно",a3,'и принадлежит типу',typeof(a3));
console.log("Выражение '5'- 3 равно",a4,'и принадлежит типу',typeof(a4));
console.log("Выражение 75 + 'кг' равно",a5,'и принадлежит типу',typeof(a5));
console.log('Выражение 785 * 653 равно',a6,'и принадлежит типу',typeof(a6));
console.log('Выражение 100 / 25 равно',a7,'и принадлежит типу',typeof(a7));
console.log('Выражение 0 * 0 равно',a8,'и принадлежит типу',typeof(a8));
console.log('Выражение 0 / 2 равно',a9,'и принадлежит типу',typeof(a9));
console.log('Выражение 89 / 0 равно',a10,'и принадлежит типу',typeof(a10));
console.log('Выражение 98 + 2 равно',a11,'и принадлежит типу',typeof(a11));
console.log('Выражение 5 - 98 равно',a12,'и принадлежит типу',typeof(a12));
console.log('Выражение (8 + 56 * 4) / 5 равно',a13,'и принадлежит типу',typeof(a13));
console.log('Выражение (9 - 12) * 7 / (5 + 2) равно',a14,'и принадлежит типу',typeof(a14));
console.log('Выражение +"123" равно',a15,'и принадлежит типу',typeof(a15));
console.log('Выражение 1 || 0 равно',a16,'и принадлежит типу',typeof(a16));
console.log('Выражение false || true равно',a17,'и принадлежит типу',typeof(a17));
console.log('Выражение true > 0 равно',a18,'и принадлежит типу',typeof(a18));













 




 
 


