a = 8;
b = 3;

// 1 example

/* a + 2 (x - b) = 16
a + 2x - 2b = 16
2x = 16 + 2b - a 
x = (16 + 2b -a) / 2  */

x = (16+2*b-a)/2;
console.log('x первого уравнения 8 задания равен',x);

// 2 example

/* b(x + 15)= a + 6x
bx + 15d = a + 6x
bx - 6x = a - 15b
x(b-6) = a - 15b
x =(a-15b)/(b-6)  */

x = (a - 15 * b) / (b - 6);
console.log('x второго уравнения 8 задания равен',x);

// 3 example

/* x + 2x + ax + bx = 23780
x (1 + 2 + a + b) = 23780
x = 23780 / (1 + 2 + a + b)  */

x = 23780 / (1 + 2 + a + b)
console.log('x третьего уравнения 8 задания равен',x);